Revit 2024 API
PlanViewRange Methods
The PlanViewRange type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLevelId
 Get the element id of the level for a View Depth plane
GetOffset
 Get the offset value associated with a View Depth plane
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetLevelId
 Set the level for a View Depth plane
SetOffset
 Set the offset value associated with a View Depth plane
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
PlanViewRange Class
Autodesk.Revit.DB Namespace